[
  {
    "id": 1,
    "title": "6 Pepper Chili",
    "slug": "6-pepper-chili",
    "description": "Delicious chili made with dried pasilla, arbol, chipotle, guajillo, ancho and casabel chilis!",
    "category": "Soups/Chili",
    "ingredients": [
      "3 Dried Guajillo Chiles, De-Stemmed and De-Seeded",
      "4 Dried Pasilla Chiles, De-Stemmed and De-Seeded",
      "3 Dried Casabel Chiles, De-Stemmed and De-Seeded",
      "3 Dried Ancho Chiles, De-Stemmed and De-Seeded",
      "4 Dried Chipotle Chiles, De-Stemmed and De-Seeded",
      "4 Dried Arbol Chiles, De-Stemmed and De-Seeded",
      "3 Finely Minced Jalapeños (or 4oz canned)",
      "1 Large Yellow Onion, Roughly Chopped",
      "4-5 Garlic Cloves, Crushed",
      "12oz Bacon, Chopped Roughly",
      "3 lb. Chuck Roast, Removed of Fat and Cubed (or your choice of meat)",
      "1 Tbsp Cocoa Powder",
      "3 Tbsp Corn Flour",
      "1 Tbsp Ground Cumin",
      "1 Tbsp Ground Mexican Oregano",
      "1 Tbsp Ground Coriander",
      "32oz Chicken Stock",
      "6 cans of Preferred Beans (Kidney, Pinto, etc)",
      "1 14.5 oz Cans of Quality Diced Tomatoes",
      "12oz Beer of Choice",
      "2 Tbsp Brown Sugar",
      "12oz Tomato Paste",
      "2 cans of Original or Fire Roasted RO*TEL"
    ],
    "instructions": [
      "Combine all dried chilis, free of stems and seeds and torn in small pieces, into a dry pan. Roast on medium heat til fragrant, at which point add ¾ cup of chicken stock and enough water to just cover the chilis. Simmer the liquid, then kill the heat and let steep for 10 minutes.",
      "Add the chilis and liquid to a blender, then combine with the cocoa powder, corn flour, ground cumin, Mexican oregano, and ground coriander. Pulse til this reaches a paste-like consistency. Pour in a container for later use.",
      "Add the chopped bacon to a stainless steel cooking pot big enough to hold your chili, cook until done, then remove the bacon, leaving the grease. Save the bacon for later use.",
      "De-fat the meat if it is not already done, then cut the beef in strips about half an inch wide in both directions then lay on a baking sheet and use paper towels to dry the meat. Stack the strips and cut into small cubes, then roughly chop slightly larger than the consistency of dog food or there about. Small, uneven chunks are desired. Season with salt and pepper and set aside for later use.",
      "Make sure the beef is dry, then brown the beef in batches the cooking pot, making sure the batches {are small enough so the beef doesn’t steam, but only browns, then set the beef aside for later use. Do not clean the pot of the fond.\n\nFeel free to season your beef or meat of choice during the cooking process with salt, pepper, and any seasonings of your choice!",
      "You should have some leftover grease in the pot, enough to sweat the onions and vegetables without them sticking. Roughly chop the onion, then add to the pot, along with the garlic and jalapeños. Cook til fragrant, mixing while scraping the fond from the bottom of the pot. Do not “cook down”, they should be slightly undercooked.",
      "Once fragrant and hot and steamy, deglaze with beer and bring to a simmer, mixing in the remainder of chicken stock in carton, tomato, brown sugar, tomato paste, kidney beans to preference, bacon, meat, and the chili paste from step 3.",
      "Bring to a bare-simmer and let simmer for 2-3 hours or until the beans and beef are tender and the chili has thickened. (You can also do this in a 300 degree oven, with the lid slightly ajar from the pot)."
    ],
    "image": "https://images.unsplash.com/photo-1638329389022-daef2efb71b3?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1035&q=80",
    "inactive": false,
    "chef": "John",
    "tags": ["chili", "spicy", "beef", "beans"],
    "createdAt": "2022-01-01T00:00:00.000Z",
    "updatedAt": "2022-01-01T00:00:00.000Z"
  },
  {
    "id": 2,
    "title": "Authentic Chicken Enchiladas",
    "slug": "authentic-chicken-enchiladas",
    "description": "These chicken enchiladas are sure to be crowd pleasers! Made with dried chiles and filled with juicy all white meat chicken, you are sure to leave your guests wishing they had more!",
    "category": "Mexican",
    "ingredients": [
      "1/2 tsp Cinnamon",
      "1/2 tsp Allspice",
      "8oz Mild Cheddar Cheese, shredded",
      "3 Tbsp All Purpose Flour",
      "3 Tbsp Butter",
      "2 cups Whole Milk",
      "2 lb. Chicken Breast",
      "8-12 Flour Tortillas (medium)",
      "12-16oz Oaxaca Cheese",
      "3 Poblano Peppers, halved",
      "2 Dried Pasilla Chiles",
      "12 Dried Guajillo Chiles",
      "2 Dried Ancho Chiles",
      "2 Roma Tomatoes, halved",
      "1 Large Oniion, quartered",
      "1 Tbsp Ground Mexican Oregano",
      "4 Cloves of Garlic",
      "2 tsp Ground Cumin",
      "1 Tbsp Mexican Oregano, finely ground"
    ],
    "instructions": [
      "Cut, de-seed and de-stem all of the dried chiles, then place them in a large skillet on medium-high heat. Dry roast for approximately 5 minutes or just before they start to smoke. ",
      "Douse the chiles with water, then add the halved roma tomatoes, quartered yellow onion, 4 whole garlic cloves and approximately 2 teaspoons of ground Mexican Oregano. Drop the heat to a simmer.",
      "Butterfly your chicken breasts (approximately 5-6) and submerge them into the mixture. Let the entire pan simmer for about 15 minutes, until the chicken reaches 165°F internal at the thickest point.",
      "Once the chicken has reached the target temperature, remove the chicken, then transfer the rest of the solid contents to a blender, along with 2 teaspoons of ground cumin, 1/2 teaspoon of allspice and 1/2 teaspoon of cinnamon. Add the liquid from the pan until barely covered, and blend on high until fully emulsified. Add more liquid as needed to obtain your desired saucy texture - this should not be too thin, but should still be easily pourable. Add salt and pepper to taste and set aside for later use.",
      "Shred the chicken and set aside for later use.",
      "Half 3 large poblano peppers. Char/roast in pan in a 400°F oven or over an open grill flame until the skin is blackened. Once the skin is charred and bubbly, set aside in an aluminum foil pouch with 1/4 cup of water until cool.",
      "Once cool to the touch, put on some gloves and remove the peppers. You should be able to rub the outer membrane of skin off the pepper, leaving a mushy, green pepper behind. Remove the outer membrane/skin from all peppers then slice into small cubes.",
      "Mix the cubes of Poblano and shredded chicken generously, drizzling a bit of sauce over the mixture just so it changes color. ",
      "Set aside the chicken to start on the cheese sauce. Grab a pot and put over low/medium heat.",
      "Add 3 tablespoons of flour, 3 tablespoons of butter to a pan, then slowly stream in 2 cups of milk while stirring vigorously until you are left with a white, creamy sauce.",
      "Lower the heat to low, and fold in approximately 8 oz of shredded mild/medium yellow cheddar. You should stir the sauce over the cheese so you incorporate it into the mixture, a little at a time. Do not put more than about a small handful in at once, stirring/folding until fully incorporated before adding another small handful. Do this until all of the cheese is thoroughly incorporated, then remove from heat. ",
      "It's now time to assemble! Set out a 9x13 pan, along with your medium flour tortillas, chicken and poblano mixture, enchilada sauce from earlier, and the cheese sauce. ",
      "Take out approximately 16 ounces of Oaxaca cheese, and pull apart until stringy.",
      "Assembly: grab a flour tortilla, dip it in your sauce, then place in the 9x13 pan. Add a generous scoop of chicken/poblano mixture, followed by a couple of strings of Oaxaca (this is to your liking). Roll the tortilla up moderately tight, making sure not to tear, and set against the edge of the pan. Do this until the pan is full or until you are out of tortillas. 10-12 medium flour tortillas should cover an entire 9x13 pan.",
      "Drizzle your cheese sauce over the tops of your assembled enchiladas, making sure to cover them moderately, but not drown them. Follow that with a drizzle of your sauce, and sprinkle more of the shredded mild cheddar to your liking.",
      "Cover your 9x13 pan with aluminum foil and bake at 350°F for about 20-25 minutes or until the cheese is melted and bubbly, just before it turns brown."
    ],
    "image": "https://images.unsplash.com/photo-1534352956036-cd81e27dd615?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1001&q=80",
    "inactive": false,
    "chef": "John",
    "tags": ["enchiladas", "mexican", "chicken"],
    "createdAt": "2022-01-01T00:00:00.000Z",
    "updatedAt": "2022-01-01T00:00:00.000Z"
  },
  {
    "id": 3,
    "title": "Classic Grilled Cheese",
    "slug": "classic-grilled-cheese",
    "description": "An American clasic! Two slices of bread toasted around a slice of melted American cheese!",
    "category": "Sandwiches",
    "ingredients": {
      "1": "2 Slices of American Cheese",
      "2": "2 Slices of White Bread",
      "3": "1 Tbsp Butter"
    },
    "instructions": [
      "Heat a medium-sized frying pan on low-medium heat.",
      "Spread a layer of butter over one side of 2 slices of bread.",
      "Place 2 slices of American cheese on top of the unbuttered side of 1 slice of the bread",
      "Place the remaining slice of bread on top of the cheese, butter side up. The butter should be on the outside of this cheese sandwich.",
      "Place the cheese sandwich in the pan, and let it cook for 2-4 minutes until golden brown or until your preferred level of crispiness has been achieved.",
      "Carefully flip the sandwich and cook the other side for 2-4 minutes until golden brown or until your preferred level of crispiness has been achieved.",
      "Once both sides are crispy to your liking, transfer to a plate to serve and enjoy!"
    ],
    "image": "https://images.unsplash.com/photo-1634598604019-7fca68ad3b8e?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1035&q=80",
    "inactive": false,
    "chef": "John",
    "tags": ["grilled cheese", "sandwich", "american"],
    "createdAt": "2022-01-01T00:00:00.000Z",
    "updatedAt": "2022-01-01T00:00:00.000Z"
  },
  {
    "id": 4,
    "title": "Orange Zest Blueberry Pie",
    "slug": "orange-zest-blueberry-pie",
    "description": "This delicious blueberry pie will leave you wondering why you never tried it before! Inspired by MasterChef Season 5 Contestant Jaimee Vitolo, the orange zest and liqueur adds a nice contrast to the sweet blueberries!",
    "category": "Desserts",
    "ingredients": [
      "2 1/2 cups All Purpose Flour",
      "1 tsp. Salt",
      "1 tsp. Cinnamon",
      "1/4 tsp. Allspice",
      "1/4 tsp. Ground Ginger",
      "2 Tbsp. Sugar",
      "1/4 cup Shortening, Cold",
      "1/4 cup Water, cold",
      "1/2 cup Butter, Cold",
      "3 Tbsp Sour Cream",
      "5 cups Fresh Blueberries",
      "1/2 cup Sugar",
      "Zest and Juice of One Orange",
      "1/4 cup Flour",
      "1 Tbsp. Orange Liqueur",
      "1 tsp. Orange Blossom Water",
      "1/4 tsp. Salt"
    ],
    "instructions": [
      "Preheat the oven to 375°F.",
      "Mix the dry ingredients in a large bowl. Using a pastry cutter, cut in the butter and shortening until the mixture resembles coarse meal. ",
      "In a separate bowl whisk together the egg, sour cream and water. Make a well in the center of the flour mixture and pour in the wet ingredients. Slowly incorporate the two together until the dough comes together. ",
      "Divide the dough into two discs and cover in plastic wrap. Refrigerate for 15 minutes.",
      "In a large bowl, toss the blueberries with the dry ingredients. Add in the wet ingredients and mix to combine.\n\n",
      "On a floured work surface roll out the first disc of dough into a 12 inch round. Transfer to a 9-inch pie dish. Trim the dough so there is only a ½ inch overhang.\n\n",
      "Transfer the blueberry filling to the pie dish lined with dough. Arrange the dough strips on top of the filling to form a lattice. Trim the excess dough. Fold the bottom crust over the ends of the strips and crimp to seal.",
      "Place the pie on a baking sheet and bake for approximately 1 hour until the crust is golden.\nCool to room temperature and serve.\n",
      "Yeild: 1 (9inch) pie"
    ],
    "image": "https://images.unsplash.com/photo-1619051965508-0872c572ee34?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1364&q=80",
    "inactive": false,
    "chef": "John",
    "tags": ["blueberry", "pie", "blueberries", "orange", "orange zest", "dessert"],
    "createdAt": "2022-01-01T00:00:00.000Z",
    "updatedAt": "2022-01-01T00:00:00.000Z"
  },
  {
    "id": 5,
    "title": "The Best Sweet Potato Casserole",
    "slug": "best-sweet-potato-casserole",
    "description": "This sweet potato casserole is sprinkled with a nutty crumb topping to create a pleasantly crunchy contrast to the creamy and soft mashed sweet potatoes down below. The filling gets an extra special pumpkin pie(ish) treatment with brown sugar and vanilla for a deep caramel flavor.",
    "category": "Sides",
    "ingredients": [
      "1/2 stick (4 Tbsp) unsalted butter - melted + more for buttering the dish",
      "3-4 Large Sweet Potatoes, peeled and cubed (about 1 3/4 pounds)",
      "1/2 cup milk",
      "1/4 cup brown sugar, packed",
      "1 tsp pure vanilla extract",
      "1/2 tsp kosher salt",
      "2 large eggs",
      "1/2 cup all-purpose flour",
      "1/2 cup brown sugar, packed",
      "1/2 stick (4 Tbsp) unsalted butter, melted",
      "1/4 tsp kosher salt",
      "3/4 cup chopped pecans"
    ],
    "instructions": [
      "For the sweet potatoes: Add 1 3/4 pounds peeled and cubed sweet potatoes to a large pot of salted water. Bring to a boil over high heat, then lower the heat to a simmer and cook until the potatoes are very tender, 15 to 20 minutes. Drain and cool. Mash the sweet potatoes.",
      "For the filling: Preheat the oven to 350 degrees F. Butter a 2-quart baking dish. \n\nWhisk together the butter, mashed potatoes, milk, brown sugar, vanilla, salt and eggs in a large bowl. Transfer to the prepared baking dish",
      "For the topping: Combine the flour, brown sugar, butter and salt in a medium bowl until moist and the mixture clumps together. Stir in the pecans. Sprinkle the mixture over the top of the sweet potatoes in an even layer. Bake until mostly set in the center and golden on top, 25-30 minutes. Serve hot.",
      "Special Equipment: 2 Quart Baking Dish"
    ],
    "image": "https://images.unsplash.com/photo-1576087171302-0a4d84681c40?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2252&q=80",
    "inactive": false,
    "chef": "Becky",
    "tags": ["sides", "sweet potato", "casserole", "holiday"],
    "createdAt": "2022-01-01T00:00:00.000Z",
    "updatedAt": "2022-01-01T00:00:00.000Z"
  }
]